Repository: quangtm-xyz/reels
Catalog: InstaReels/Resources/Pages.Index.*.resx
Languages: ar, vi

# App.Title
source: Reels Downloader
ar: أداة تنزيل ريلز إنستغرام
vi: Tải Reels & Video Instagram

# UI.Contact
source: Contact for Advertising
ar: للتواصل للإعلانات
vi: Liên hệ quảng cáo

# UI.Input.Placeholder
source: Paste Instagram link here...
ar: ألصِق رابط إنستغرام هنا...
vi: Dán link Instagram (Reels, Video, IGTV) vào đây...

# UI.Download
source: Download
ar: تحميل
vi: Tải xuống

# UI.Intro
source: This is a tool that allows you to download reels and videos from Instagram - free and no watermark.
ar: تتيح لك هذه الأداة تنزيل ريلز وفيديوهات إنستغرام مجانًا ومن دون علامة مائية.
vi: Đây là công cụ giúp bạn tải Reels và video từ Instagram - miễn phí và không có logo.

# Description.Title
source: About Reels Downloader
ar: حول Reels Downloader
vi: Về công cụ tải Reels

# Description.Text
source: Reels Downloader is a simple yet powerful tool that lets you download high-quality, watermark-free Instagram reels and videos for free. Just paste the link and click Downloadâ€”your video is ready in seconds, processed securely without storing any personal data. It supports all Instagram content types and works smoothly on all devices.
ar: Reels Downloader هو أداة قوية وسهلة الاستخدام تساعدك على تنزيل ريلز وفيديوهات إنستغرام بكل سلاسة. منصتنا تمنحك تجربة مريحة لحفظ محتواك المفضل ومشاهدته دون اتصال. يمكنك تنزيل فيديوهات عالية الجودة بدون علامات مائية وبشكل مجاني تمامًا. ما عليك سوى لصق رابط الريلز أو الفيديو في حقل الإدخال، ثم الضغط على زر التحميل ليصبح المحتوى جاهزًا خلال ثوانٍ. تدعم الأداة جميع أنواع محتوى إنستغرام بما فيها الريلز وIGTV والمنشورات العادية. نولي خصوصيتك وأمانك أهمية قصوى، لذا تتم جميع العمليات بأمان تام من دون تخزين بياناتك أو الملفات التي تنزلها. العملية بسيطة ولا تتطلب أي معرفة تقنية؛ انسخ الرابط من إنستغرام، الصقه هنا، وابدأ التنزيل فورًا. تعمل خدمتنا على جميع الأجهزة مثل الحواسيب والأجهزة اللوحية والهواتف، لتتمكن من التنزيل من أي مكان. كما نواصل تحديث المنصة لدعم أحدث مزايا إنستغرام وضمان التوافق مع كل صيغ الفيديو.
vi: Reels Downloader hỗ trợ bạn tải nội dung Instagram chất lượng cao chỉ với vài bước đơn giản. Chúng tôi luôn ưu tiên bảo mật, không lưu trữ dữ liệu tải xuống và hoạt động tốt trên mọi thiết bị. Chỉ cần dán liên kết, bấm tải và tận hưởng video của bạn ngoại tuyến.

# FAQ.Title
source: Frequently Asked Questions
ar: الأسئلة الشائعة
vi: Câu hỏi thường gặp

# Footer.Contact
source: Contact
ar: تواصل
vi: Liên hệ

# Footer.Legal
source: Legal
ar: قانوني
vi: Điều khoản

# Footer.Terms
source: Terms
ar: الشروط
vi: Điều khoản sử dụng

# Footer.Privacy
source: Privacy Policy
ar: سياسة الخصوصية
vi: Chính sách bảo mật

# Footer.Tools
source: Tools
ar: الأدوات
vi: Công cụ

# Error.General
source: An error occurred while processing your request. Please try again later.
ar: حدث خطأ أثناء معالجة طلبك. يرجى المحاولة لاحقًا.
vi: Đã xảy ra lỗi khi xử lý yêu cầu. Vui lòng thử lại sau.

# Error.InvalidLink
source: The Instagram link is invalid or the video is private.
ar: رابط إنستغرام غير صالح أو أن الفيديو خاص.
vi: Liên kết Instagram không hợp lệ hoặc video đang để chế độ riêng tư.

# Status.Processing
source: Processing link... Please wait.
ar: جارٍ معالجة الرابط... يرجى الانتظار.
vi: Đang xử lý link... Vui lòng chờ.

# Lang.English
source: English
ar: الإنجليزية

# Lang.Vietnamese
source: Vietnamese
ar: الفيتنامية
vi: Tiếng Việt

# Lang.Indonesian
source: Indonesian
ar: الإندونيسية
vi: Bahasa Indonesia

# Lang.Bengali
source: Bengali
ar: البنغالية
vi: বাংলা

# Lang.Arabic
source: Arabic
ar: العربية
vi: العربية

# FAQ.1.Question
source: How to download TikTok videos without watermark?
ar: كيف أحمل فيديوهات تيك توك بدون علامة مائية؟
vi: Làm sao tải video TikTok không logo?

# FAQ.1.Answer
source: To download TikTok videos without watermark, simply paste the video URL into our downloader tool and click the download button. Our service automatically removes watermarks from downloaded content.
ar: انسخ رابط الفيديو وضعه في أداتنا ثم اضغط زر التحميل، وسيتم إزالة العلامة المائية تلقائيًا.
vi: Chỉ cần dán URL video vào công cụ và bấm tải xuống. Hệ thống sẽ tự loại bỏ watermark.

# FAQ.2.Question
source: How to get the TikTok video download link?
ar: كيف أحصل على رابط تنزيل فيديو تيك توك؟
vi: Làm thế nào lấy link tải TikTok?

# FAQ.2.Answer
source: Copy the video link from TikTok by clicking the share button on any video, then paste it into our downloader to get the direct download link.
ar: اضغط زر المشاركة في تيك توك وانسخ رابط الفيديو، ثم الصقه في أداة التنزيل لتحصل على رابط مباشر.
vi: Sao chép liên kết từ nút chia sẻ của TikTok rồi dán vào công cụ để nhận link tải trực tiếp.

# FAQ.3.Question
source: Where are TikTok videos saved after being downloaded?
ar: أين تُحفظ فيديوهات تيك توك بعد تنزيلها؟
vi: Video tải về được lưu ở đâu?

# FAQ.3.Answer
source: Downloaded videos are saved to your device's default download folder. On mobile devices, they typically go to your gallery or downloads folder.
ar: تُحفظ الفيديوهات في مجلد التنزيلات الافتراضي على جهازك، أو في المعرض أو مجلد التحميلات على الهواتف.
vi: Video được lưu ở thư mục tải xuống mặc định trên thiết bị hoặc thư viện ảnh (di động).

# FAQ.4.Question
source: Does SnapTik.App store downloaded videos or keep a copy of videos?
ar: هل يحتفظ SnapTik.App بنسخة من الفيديوهات التي أنزلها؟
vi: Công cụ có lưu video của tôi không?

# FAQ.4.Answer
source: No, we do not store or keep copies of any downloaded videos. All processing is done in real-time and videos are only saved to your device.
ar: لا، تتم كل العمليات لحظيًا ويتم حفظ الملف فقط على جهازك.
vi: Không. Tất cả được xử lý thời gian thực và chỉ lưu trên thiết bị của bạn.

# FAQ.5.Question
source: Do I need to install instructions or extensions?
ar: هل أحتاج إلى تثبيت تطبيق أو إضافة متصفح؟
vi: Có cần cài app hay tiện ích mở rộng?

# FAQ.5.Answer
source: No installation or browser extensions are required. Our tool works directly in your web browser without any additional software.
ar: لا حاجة لأي تثبيت إضافي؛ تعمل الأداة مباشرة داخل المتصفح.
vi: Không cần cài đặt thêm. Công cụ chạy trực tiếp trên trình duyệt.

# FAQ.6.Question
source: Do I have to pay to use the TikTok Downloader without watermark?
ar: هل يجب أن أدفع مقابل استخدام أداة تنزيل تيك توك بلا علامة مائية؟
vi: Dịch vụ này có miễn phí?

# FAQ.6.Answer
source: No, our service is completely free to use. You can download unlimited videos without watermarks at no cost.
ar: الخدمة مجانية تمامًا ولا توجد أي قيود على عدد التنزيلات.
vi: Hoàn toàn miễn phí và không giới hạn lượt tải.

# FAQ.7.Question
source: Can I use this TikTok video downloader on my Android phone?
ar: هل يمكنني استخدام أداة التنزيل هذه على هاتف أندرويد؟
vi: Có dùng được trên Android không?

# FAQ.7.Answer
source: Yes, our downloader is fully compatible with Android devices. Simply access our website through your mobile browser and use it just like on desktop.
ar: نعم، افتح موقعنا عبر متصفح الهاتف واستعمله كما تفعل على الحاسوب.
vi: Có. Chỉ cần mở trang web trên trình duyệt di động để sử dụng.

# FAQ.8.Question
source: How do I save TikTok videos to my iPhone (iOS)?
ar: كيف أحفظ فيديوهات تيك توك على آيفون (iOS)؟
vi: Lưu video về iPhone thế nào?

# FAQ.8.Answer
source: On iPhone, paste the TikTok video link into our downloader, click download, and the video will be saved to your Photos app automatically.
ar: الصق رابط تيك توك في أداتنا، اضغط تحميل، وسيُحفظ الفيديو تلقائيًا داخل تطبيق الصور.
vi: Dán link vào công cụ, bấm tải và video sẽ nằm trong ứng dụng Ảnh.

# FAQ.9.Question
source: Is there a limit to the number of TikTok videos I can download?
ar: هل توجد حدود لعدد فيديوهات تيك توك التي يمكن تنزيلها؟
vi: Có giới hạn số video tải không?

# FAQ.9.Answer
source: No, there are no limits on the number of videos you can download. Use our service as much as you need, completely free.
ar: لا توجد أي حدود؛ يمكنك التنزيل قدر ما تشاء مجانًا.
vi: Không. Bạn có thể tải không giới hạn.

# FAQ.10.Question
source: Does the downloader support saving multiple videos at once?
ar: هل يدعم المُنزِّل تنزيل عدة فيديوهات دفعة واحدة؟
vi: Có tải nhiều video cùng lúc được không?

# FAQ.10.Answer
source: Currently, our tool supports downloading individual videos. For multiple videos, you'll need to download them one at a time by pasting each video link separately.
ar: في الوقت الحالي ندعم تنزيل فيديو واحد في كل مرة عبر لصق كل رابط على حدة.
vi: Hiện tại mỗi lần tải một video bằng cách dán từng liên kết.

# FAQ.11.Question
source: Can I download high resolution TikTok videos?
ar: هل أستطيع تنزيل فيديوهات تيك توك بدقة عالية؟
vi: Có tải được video chất lượng cao không?

# FAQ.11.Answer
source: Yes, our downloader supports high-resolution video downloads. The quality depends on the original video quality available from the source.
ar: نعم، ويتوقف مستوى الجودة على جودة الفيديو الأصلي المتاحة.
vi: Có, chất lượng phụ thuộc vào nguồn video gốc.

# FAQ.12.Question
source: Can I edit TikTok videos after downloading them?
ar: هل أستطيع تعديل فيديوهات تيك توك بعد تنزيلها؟
vi: Có chỉnh sửa video sau khi tải được không?

# FAQ.12.Answer
source: Once downloaded, you can edit the videos using any video editing software on your device, as they are saved as standard MP4 files.
ar: بالتأكيد، فملفات MP4 القياسية يمكن تحريرها بأي برنامج مونتاج.
vi: Hoàn toàn có thể vì file tải về là MP4 tiêu chuẩn.

# FAQ.13.Question
source: Does the downloader provide a TikTok MP3 solution?
ar: هل توفر الأداة حلاً لاستخراج MP3 من تيك توك؟
vi: Có hỗ trợ tách MP3 không?

# FAQ.13.Answer
source: Currently, our service focuses on video downloads. For MP3 extraction, you may need to use additional audio extraction tools after downloading the video.
ar: نركّز حاليًا على تنزيل الفيديوهات فقط، ويمكنك استخدام أدوات أخرى لاستخراج الصوت بعد التنزيل.
vi: Hiện công cụ tập trung vào video. Bạn có thể dùng phần mềm khác để tách âm thanh.
